# 假設電力公司的電費計算方式分成三類：
# 1. 家庭用電:100度以下,每度2.5元, 101~300度，每度3.3元；301度以上每度4.2元。
# 2. 工業用電：基本費為150元，實際用電費每度1.9元。
# 3. 營業用電：0~300度，每度6元；301度(含)以上每度6.8元。
# 設計程式輸入用電類別M以及使用度數N，算出電費。(請上傳PowerFee.py檔) 

M = int(input("輸入類別:"))
N = int(input("輸入度數:"))
if (M == 1):

    if (N <=100):
       
       print(N*2.5)
    
    elif (N >= 100) and (N <= 300):
       
        print(N*3.3)
    
    elif (N >= 301):
       
        print(N*4.2)

elif (M == 2):
    
    print(150 + (N * 1.9))

elif (M == 3):
    
    if(N >= 0) and (N >= 300):
    
        print(N * 6)
    
    if (N > 301):
    
        print(N * 6.8)